simulacoes/lombada/rhoPimpleFoam/bumpHidro/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1e-07;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxDeltaT       5e-06;

maxCo           0.1;

runTimeModifiable true;

functions
{
    #includeFunc components(U)
    #includeFunc mag(U)
    
    Mach
    {
        type           MachNo;
        libs           (fieldFunctionObjects);
        writeControl   runTime;
        writeInterval  0.1;
    }
    
}


// ************************************************************************* //
